Repository: bone204/tour_guide_client
Catalog: lib/core/config/lang/arb/app_*.arb
Languages: vi

source: Sign in now
vi: Đăng nhập ngay

# signInDescription
source: Please sign in to continue using our app
vi: Vui lòng đăng nhập để tiếp tục sử dụng ứng dụng của chúng tôi

# usernameOrEmail
source: Username/Email
vi: Tên đăng nhập/Email

source: Enter username or email
vi: Nhập tên đăng nhập hoặc email

source: Password
vi: Mật khẩu

source: Enter Password
vi: Nhập mật khẩu

source: Forgot Password?
vi: Quên mật khẩu?

source: Sign In
vi: Đăng nhập

# noAccount
source: Don't have an account?
vi: Chưa có tài khoản?

source: Or connect
vi: Hoặc kết nối

source: Sign up now
vi: Đăng ký ngay

# signUpDescription
source: Please fill the details and create account
vi: Vui lòng điền thông tin và tạo tài khoản

source: Username
vi: Tên đăng nhập

source: Enter Username
vi: Nhập tên đăng nhập

# enterEmail
source: Enter Your Email
vi: Nhập email

source: Confirm Password
vi: Xác nhận mật khẩu

# enterConfirmPassword
source: Re-enter your password
vi: Nhập lại mật khẩu

source: Sign Up
vi: Đăng ký

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

source: Sign Out
vi: Đăng Xuất

# discoverSub
source: Discover and share unique travel experiences
vi: Khám phá và chia sẻ những trải nghiệm du lịch độc đáo

source: Search...
vi: Tìm kiếm...

# searchButton
source: Search
vi: Tìm kiếm

# accountAndSecurity
source: Account & Security
vi: Tài khoản & Bảo mật

# personalInfo
source: Personal Information
vi: Thông tin cá nhân

# accountInfo
source: Account Information
vi: Thông tin tài khoản

source: Change Password
vi: Đổi mật khẩu

source: Language
vi: Ngôn ngữ

# terms
source: Terms & Conditions
vi: Điều khoản & Điều kiện

# policy
source: Privacy Policy
vi: Chính sách bảo mật

# contact
source: Contact Us
vi: Liên hệ

source: Settings
vi: Cài đặt

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

source: Car Rental
vi: Thuê Xe Hơi

# bikeRental
source: Motorbike Rental
vi: Thuê Xe Máy

source: Bus Booking
vi: Đặt Xe Buýt

# findRes
source: Find Restaurant
vi: Tìm Nhà Hàng

# delivery
source: Fast Delivery
vi: Giao Hàng

source: Find Hotel
vi: Tìm khách sạn

source: Exclusive Vouchers
vi: Ưu đãi đặc biệt

source: Popular
vi: Phổ biến

# popularDes
source: The best destination for you
vi: Điểm đến tốt nhất dành cho bạn

# nearby
source: Destination nearby
vi: Các địa điểm gần đây

# nearbyDes
source: Explore spots around you
vi: Khám phá các địa điểm xung quanh bạn

# hotelNearby
source: Hotels nearby
vi: Khách sạn gần bạn

# hotelNearbyDes
source: Nearby hotels for your stay
vi: Những khách sạn thuận tiện ngay gần bạn

# restaurantNearby
source: Restaurants nearby
vi: Nhà hàng gần bạn

# restaurantNearbyDes
source: Dining options nearby
vi: Các quán ăn ngon ngay gần bạn

# attraction
source: More travel inspiration
vi: Cảm hứng du lịch

# attractionDes
source: Extra highlights for you!
vi: Điểm nhấn thêm cho bạn!

source: Price range
vi: Khoảng giá

source: Hourly Rent
vi: Thuê theo giờ

source: Daily Rent
vi: Thuê theo ngày

source: Start Date
vi: Ngày bắt đầu

source: End Date
vi: Ngày kết thúc

source: Select date and hour
vi: Chọn ngày và giờ

source: Start hour
vi: Giờ bắt đầu

source: End hour
vi: Giờ kết thúc

# selectHour
source: Selecr hour
vi: Chọn giờ

source: Pickup location
vi: Địa điểm nhận

source: Select pickup location
vi: Chọn địa điểm nhận

source: Rent
vi: Thuê

source: Car List
vi: Danh Sách Xe Hơi

source: Motorbike List
vi: Danh Sách Xe Máy

source: Details
vi: Chi tiết

source: day
vi: ngày

source: seats
vi: chỗ

source: Car Details
vi: Chi Tiết Xe

# mortorbikeDetails
source: Motorbike Details
vi: Chi Tiết Xe

source: Features
vi: Tiện ích

source: Description
vi: Mô tả

source: reviews
vi: Đánh giá

# rentalInfo
source: Rental Information
vi: Thông Tin Thuê Xe

# customers
source: Customer
vi: Khách hàng

# phone
source: Phone number
vi: Số điện thoại

# owner
source: Car owner
vi: Chủ xe

source: Rental days
vi: Số ngày thuê

source: Subtotal
vi: Tạm tính

# discountPoint
source: Reward points discount
vi: Trừ điểm thưởng

source: Total Payment
vi: Tổng thanh toán

# choosePayment
source: Choose payment method
vi: Chọn phương thức thanh toán

source: Price Per Day
vi: Giá theo ngày

# useRewardPoint
source: Use reward points
vi: Sử dụng điểm thưởng

source: Available points
vi: Điểm hiện có

# noUsePoint
source: Do not use points
vi: Không sử dụng điểm

source: points
vi: điểm

# flight
source: Flight Booking
vi: Đặt Chuyến bay

# train
source: Train Booking
vi: Đặt vé Tàu

source: Error
vi: Lỗi

source: Retry
vi: Thử lại

source: Close
vi: Đóng

source: Exit app?
vi: Thoát ứng dụng?

# exitAppConfirm
source: Are you sure you want to exit the app?
vi: Bạn có chắc chắn muốn thoát ứng dụng?

source: Cancel
vi: Hủy

source: Exit
vi: Thoát

source: News Page
vi: Trang Tin tức

# errorPrefix
source: Error:
vi: Lỗi:

# pleaseSelectLocation
source: Please select a location and make sure location is enabled.
vi: Vui lòng chọn một địa điểm và đảm bảo đã bật vị trí.

# navigatingCannotSelect
source: Currently navigating, cannot select another destination.
vi: Đang điều hướng, không thể chọn điểm đến khác.

# locationNoData
source: Location does not have position data.
vi: Địa điểm chưa có dữ liệu vị trí.

# pleaseSelectSeat
source: Please select a seat
vi: Vui lòng chọn ghế

# pleaseSelectSeatClass
source: Please select a seat class
vi: Vui lòng chọn hạng ghế

# maxSeatsSelected
source: Maximum {maxSeats} seats can be selected
vi: Chỉ được chọn tối đa {maxSeats} ghế

# departureTrip
source: Departure
vi: Chuyến đi

# returnTrip
source: Return
vi: Chuyến về

# bothTripsSelected
source: Both trips selected. Full round-trip booking feature will be completed later.
vi: Đã chọn cả 2 chuyến. Chức năng đặt vé khứ hồi đầy đủ sẽ hoàn thiện sau.

source: Downloading ticket...
vi: Đang tải vé xuống máy...

source: Sharing ticket...
vi: Chia sẻ vé...

source: Please select at least one room
vi: Vui lòng chọn ít nhất 1 phòng

# pleaseSelectDeliveryCompany
source: Please select a delivery company
vi: Vui lòng chọn hãng giao hàng

# pleaseSelectVehicleType
source: Please select a vehicle type
vi: Vui lòng chọn loại xe

# pleaseSelectPickupPoint
source: Please select a pickup point
vi: Vui lòng chọn điểm lấy hàng

# pleaseSelectDeliveryPoint
source: Please select a delivery point
vi: Vui lòng chọn điểm nhận hàng

# errorSelectingImage
source: Error selecting image: {error}
vi: Lỗi khi chọn ảnh: {error}

source: Take photo
vi: Chụp ảnh

source: Select from gallery
vi: Chọn từ thư viện

source: Select package image
vi: Chọn ảnh kiện hàng

source: Package images
vi: Hình ảnh kiện hàng

source: Add image
vi: Thêm ảnh

# bookingSuccess
source: Booking Successful!
vi: Đặt phòng thành công!

# tableBookingSuccess
source: Table booking successful!
vi: Đặt bàn thành công!

# pleaseConfirmPolicies
source: Please confirm all policies
vi: Vui lòng xác nhận tất cả các chính sách

source: Add Location
vi: Thêm địa điểm

# allLocationsAdded
source: All locations have been added to the itinerary
vi: Đã thêm tất cả địa điểm vào ngày này

# pleaseSelectSeatTrain
source: Please select a seat
vi: Vui lòng chọn chỗ

# pleaseSelectSeatClassTrain
source: Please select a seat class
vi: Vui lòng chọn hạng chỗ

# maxSeatsSelectedTrain
source: Maximum {maxSeats} seats can be selected
vi: Chỉ được chọn tối đa {maxSeats} chỗ

# pleaseSelectSeatBus
source: Please select a seat
vi: Vui lòng chọn ghế

# maxSeatsSelectedBus
source: Maximum {maxSeats} seats can be selected
vi: Chỉ được chọn tối đa {maxSeats} ghế

source: Something went wrong
vi: Đã xảy ra lỗi

# noRouteDefined
source: No route defined for {routeName}
vi: Không có route được định nghĩa cho {routeName}

# bookingInfo
source: Booking Information
vi: Thông tin đặt phòng

source: Confirm Booking
vi: Xác nhận đặt phòng

source: Order Details
vi: Chi tiết đơn hàng

source: Confirm
vi: Xác nhận

# tableBookingInfo
source: Table Booking Information
vi: Thông tin đặt bàn

source: Confirm Table Booking
vi: Xác nhận đặt bàn

# fastDeliveryTitle
source: Fast Delivery
vi: Giao hàng nhanh

# continueButton
source: Continue
vi: Tiếp tục

source: Select Room
vi: Chọn phòng

source: Bus Ticket
vi: Vé xe khách

source: Back to Home
vi: Về trang chủ

source: Download Ticket
vi: Tải vé về máy

source: Share Ticket
vi: Chia sẻ vé

source: Select Bus Trip
vi: Chọn chuyến xe

source: Select Round Trip
vi: Chọn vé khứ hồi

source: Bus Trip Details
vi: Chi tiết chuyến xe

# busTripInfo
source: Bus Trip Information
vi: Thông tin chuyến xe

source: Amenities
vi: Tiện nghi

source: Train Ticket
vi: Vé tàu hỏa

source: Train Trip Details
vi: Chi tiết chuyến tàu

# trainTripInfo
source: Train Trip Information
vi: Thông tin chuyến tàu

source: Train Amenities
vi: Tiện nghi trên tàu

source: Select seat to continue
vi: Chọn chỗ để tiếp tục

source: Flight Ticket
vi: Vé máy bay

source: Flight Trip Details
vi: Chi tiết chuyến bay

# flightTripInfo
source: Flight Trip Information
vi: Thông tin chuyến bay

source: Flight Amenities
vi: Tiện nghi trên chuyến bay

# selectSeatToContinueFlight
source: Select seat to continue
vi: Chọn ghế để tiếp tục

source: Select Flight Trip
vi: Chọn chuyến bay

source: Select Train Trip
vi: Chọn chuyến tàu

# selectProvince
source: Select Province/City
vi: Chọn tỉnh/thành phố

source: Create Itinerary
vi: Tạo lộ trình

source: My Vehicle
vi: Xe của tôi

# vehicleRentalRegister
source: Vehicle Rental Registration
vi: Đăng ký thuê xe

source: Add Vehicle
vi: Thêm xe

source: Business Register Photo
vi: Ảnh đăng ký kinh doanh

source: Identification Photo
vi: Ảnh giấy tờ tùy thân

source: Vehicle Registration Front Photo
vi: Ảnh mặt trước đăng ký xe

source: Vehicle Registration Back Photo
vi: Ảnh mặt sau đăng ký xe

# travelAssistant
source: Traveline Travel Assistant
vi: Trợ lý du lịch Traveline

source: Book Table
vi: Đặt bàn

source: Book Room
vi: Đặt phòng

# confirmBookingTicket
source: Confirm Booking
vi: Xác nhận đặt vé

source: Book Flight
vi: Đặt vé máy bay

source: Find Flight
vi: Tìm chuyến bay

source: Book Train
vi: Đặt vé tàu hỏa

source: Find Train
vi: Tìm chuyến tàu

source: Hotel List
vi: Danh sách khách sạn

source: Select Table
vi: Chọn bàn

source: Restaurant List
vi: Danh sách nhà hàng

source: Find Restaurant
vi: Tìm nhà hàng

source: Confirm Order
vi: Xác nhận đơn hàng

source: Payment
vi: Thanh toán

source: Book Bus
vi: Đặt vé xe khách

# findBus
source: Find Bus Trip
vi: Tìm chuyến xe

source: Customer
vi: Khách hàng

source: Phone Number
vi: Số điện thoại

source: Table
vi: Bàn

source: Number of People
vi: Số người

source: Location
vi: Vị trí

source: Time
vi: Thời gian

source: Deposit
vi: Tiền đặt cọc

source: Pickup Point
vi: Điểm lấy hàng

source: Delivery Point
vi: Điểm nhận hàng

source: Recipient Name
vi: Tên người nhận

source: Recipient Phone
vi: Số điện thoại người nhận

source: Check-in
vi: Nhận phòng

source: Check-out
vi: Trả phòng

source: Number of nights
vi: Số đêm

source: Total Room Price
vi: Tổng tiền phòng

source: Business Type
vi: Loại hình

source: Business Name
vi: Tên doanh nghiệp

source: Business Address
vi: Địa chỉ

source: Tax Code
vi: Mã số thuế

source: Full Name
vi: Họ và tên

source: Identification Number
vi: CMND/CCCD

source: Departure Point
vi: Điểm đi

source: Arrival Point
vi: Điểm đến

source: Departure Date
vi: Ngày đi

source: Return Date
vi: Ngày về

source: Number of Passengers
vi: Số hành khách

source: Booking Time
vi: Thời gian đặt bàn

source: Food Type
vi: Loại đồ ăn

source: Check In Date
vi: Ngày nhận phòng

source: Check Out Date
vi: Ngày trả phòng

source: Departure Station
vi: Ga đi

source: Arrival Station
vi: Ga đến

source: Departure Airport
vi: Sân bay đi

source: Arrival Airport
vi: Sân bay đến

source: Delivery Requirements
vi: Yêu cầu khi gửi

source: Bank Name
vi: Ngân hàng

source: Bank Account Number
vi: Số tài khoản

source: Bank Account Name
vi: Chủ tài khoản

# confirmInfoAccurate
source: I confirm that all information provided is accurate and complete
vi: Tôi xác nhận tất cả thông tin đã cung cấp là chính xác và đầy đủ

# agreeToTerms
source: I agree to the terms and conditions of vehicle rental services
vi: Tôi đồng ý với các điều khoản và điều kiện của dịch vụ thuê xe

# authorizeBankingInfo
source: I authorize the platform to use my banking information for payment processing
vi: Tôi ủy quyền cho nền tảng sử dụng thông tin ngân hàng của tôi để xử lý thanh toán

# fullNameLabel
source: Full Name
vi: Họ và tên

# cmndCccd
source: ID Card/CCCD
vi: CMND/CCCD

# businessTypeLabel
source: Business Type
vi: Loại hình

source: Company Name
vi: Tên doanh nghiệp

source: Address
vi: Địa chỉ

source: Bank
vi: Ngân hàng

source: Account Holder
vi: Chủ tài khoản

source: Account Number
vi: Số tài khoản

source: Note
vi: Ghi chú

source: Rejection Reason
vi: Lý do từ chối

source: Last Updated
vi: Cập nhật lần cuối

source: Vehicle Type
vi: Loại xe

# brandAndModel
source: Brand & Model
vi: Thương hiệu & dòng xe

source: Color
vi: Màu sắc

source: Number of Seats
vi: Số chỗ ngồi

source: Price Per Hour
vi: Giá theo giờ

source: Total Rentals
vi: Tổng lượt thuê

source: Average Rating
vi: Đánh giá trung bình

source: Approval Status
vi: Trạng thái duyệt

source: Available
vi: Sẵn sàng

source: Requirements
vi: Yêu cầu

# rejectionReasonLabel
source: Rejection Reason
vi: Lý do bị từ chối

source: Select Pickup Point
vi: Chọn điểm lấy hàng

source: Select Delivery Point
vi: Chọn điểm nhận hàng

source: Enter Recipient Name
vi: Nhập tên người nhận

source: Enter Recipient Phone
vi: Nhập số điện thoại

source: Enter Business Name
vi: Nhập tên doanh nghiệp

source: Enter Business Address
vi: Nhập địa chỉ

source: Enter Tax Code
vi: Nhập mã số thuế

# enterFullName
source: Enter Your Full Name
vi: Nhập họ và tên

# enterPhoneNumber
source: Enter Your Phone Number
vi: Nhập số điện thoại

# enterIdNumber
source: Enter Your ID Number
vi: Nhập số CMND/CCCD

source: Select Departure Point
vi: Chọn điểm đi

source: Select Arrival Point
vi: Chọn điểm đến

source: Select Departure Date
vi: Chọn ngày đi

source: Select Return Date
vi: Chọn ngày về

source: Select Date and Time
vi: Chọn ngày và giờ

source: Select Location
vi: Chọn vị trí

source: Select Check In Date
vi: Chọn ngày nhận phòng

source: Select Check Out Date
vi: Chọn ngày trả phòng

source: Select Place
vi: Chọn địa điểm

source: Select Departure Station
vi: Chọn ga đi

source: Select Arrival Station
vi: Chọn ga đến

source: Select Departure Airport
vi: Chọn sân bay đi

source: Select Arrival Airport
vi: Chọn sân bay đến

source: Enter Account Number
vi: Nhập số tài khoản

source: Enter Account Holder Name
vi: Nhập tên chủ tài khoản

source: Enter Price Per Hour
vi: Nhập giá theo giờ

source: Enter Price Per Day
vi: Nhập giá theo ngày

source: Enter Registration Number
vi: Nhập số đăng ký

# exampleBrand
source: e.g. Honda, Toyota
vi: VD: Honda, Toyota

# exampleModel
source: e.g. City, Wave
vi: VD: City, Wave

# exampleColor
source: e.g. Black, White
vi: VD: Đen, Trắng

# itineraryHint
source: e.g. Explore Da Nang 3 days
vi: VD: Khám phá Đà Nẵng 3 ngày

# enterFullNameHint
source: Enter Full Name
vi: Nhập họ và tên

# enterPhoneNumberHint
source: Enter Phone Number
vi: Nhập số điện thoại

source: Car
vi: Xe hơi

source: Motorbike
vi: Xe máy

source: Personal
vi: Cá nhân

source: Company
vi: Công ty

source: Vehicle Registration Number
vi: Số đăng ký xe

source: Vehicle Brand
vi: Thương hiệu xe

source: Vehicle Model
vi: Dòng xe

source: Vehicle Color
vi: Màu xe

# contractOwnerInfo
source: Contract Owner Information
vi: Thông tin chủ hợp đồng

# businessInfo
source: Business Information
vi: Thông tin kinh doanh

# bankingInfo
source: Banking Information
vi: Thông tin ngân hàng

# notesAndStatus
source: Notes & Status
vi: Ghi chú & Trạng thái

# vehicleInfo
source: Vehicle Information
vi: Thông tin xe

# priceAndPerformance
source: Price & Performance
vi: Giá & hiệu suất

# statusAndRequirements
source: Status & Requirements
vi: Tình trạng & yêu cầu

source: Business
vi: Doanh nghiệp

source: Number of Rooms
vi: Số phòng

source: Number of Guests
vi: Số khách

source: License Plate
vi: Biển số xe

source: Price Per Hour (VND)
vi: Giá theo giờ (VND)

source: Price Per Day (VND)
vi: Giá theo ngày (VND)

# fieldRequired
source: {fieldName} is required
vi: {fieldName} là bắt buộc

# pleaseEnterValidPrice
source: Please enter a valid price
vi: Vui lòng nhập giá hợp lệ

# emailRequired
source: Email is required
vi: Email là bắt buộc

# pleaseEnterValidEmail
source: Please enter a valid email
vi: Vui lòng nhập email hợp lệ

# phoneRequired
source: Phone number is required
vi: Số điện thoại là bắt buộc

# pleaseEnterValidPhone
source: Please enter a valid 10-digit phone number
vi: Vui lòng nhập số điện thoại 10 chữ số hợp lệ

# pleaseSelectBank
source: Please select a bank
vi: Vui lòng chọn ngân hàng

source: Please enter username
vi: Vui lòng nhập tên đăng nhập

# usernameMinLength
source: Username must be at least 3 characters
vi: Tên đăng nhập phải có ít nhất 3 ký tự

# usernameMaxLength
source: Username must not exceed 20 characters
vi: Tên đăng nhập không được vượt quá 20 ký tự

# usernameInvalid
source: Username can only contain letters, numbers and underscores
vi: Tên đăng nhập chỉ gồm chữ, số và gạch dưới

source: Please enter password
vi: Vui lòng nhập mật khẩu

source: Please confirm password
vi: Vui lòng xác nhận mật khẩu

# passwordMismatch
source: Passwords do not match
vi: Mật khẩu không khớp

source: Please enter email or username
vi: Vui lòng nhập email hoặc tên đăng nhập

# pleaseEnterValidEmailOrUsername
source: Please enter a valid email or username
vi: Vui lòng nhập email hoặc tên đăng nhập hợp lệ

source: Please enter recipient name
vi: Vui lòng nhập tên người nhận

source: Please enter phone number
vi: Vui lòng nhập số điện thoại

# phoneNumberInvalid
source: Invalid phone number
vi: Số điện thoại không hợp lệ

source: Approved
vi: Đã duyệt

source: Pending
vi: Đang duyệt

source: Rejected
vi: Bị từ chối

source: Inactive
vi: Ngưng

source: Rented
vi: Đang thuê

source: Maintenance
vi: Bảo trì

source: Locked
vi: Tạm khóa

source: Rental Vehicle
vi: Xe cho thuê

# rentalVehicleDefault
source: Rental vehicle
vi: Xe cho thuê

source: Next
vi: Tiếp theo

source: Back
vi: Quay lại

source: Submit
vi: Gửi

source: Start
vi: Bắt đầu

source: End
vi: Kết thúc

source: Finish
vi: Hoàn tất

source: Itinerary
vi: Lộ trình

source: Hotel
vi: Khách sạn

source: Session Expired
vi: Phiên đăng nhập hết hạn

# sessionExpiredMessage
source: Your login session has expired. Please sign in again.
vi: Phiên đăng nhập của bạn đã hết hạn. Vui lòng đăng nhập lại.
